###紀錄初始化設定###

from numpy import *
import numpy as np
import os

#產生王表

#[0]:代碼
#[1]:名稱
#[2]:重生時間(分)
#[3]:最近一次回報
#[4]:錯過次數
#[5]:備註

# 要檢查的檔案路徑
def RecodeListCheck(GroupID):
    filepath = "LineageM/RecordList_" + GroupID + ".npy"

    if os.path.isfile(filepath):                #檔案在就讀取
        Boss_List = np.load('LineageM/RecordList_' + GroupID + '.npy',allow_pickle=True)
    else:                                       #第一次執行要建出王清單檔案
        Boss_List = np.array([
            ['Boss_04','死亡騎士','','','','','',''],
            ['Boss_05','巨型蠕蟲','','','','','',''],
            ['Boss_26','守護螞蟻','','','','','',''],
            ['Boss_28','強盜頭目','','','','','',''],
            ['Boss_35','蜘蛛','','','','','',''],
            ['Boss_44','巨大鱷魚','','','','','',''],
            ['Boss_62','大腳瑪幽','','','','','',''],
            ['Boss_70','古代巨人','','','','','',''],
            ['Boss_73','巨大飛龍','','','','','',''],
            ['Boss_74','74小飛龍','','','','','',''],
            ['Boss_76','76飛龍','','','','','',''],
            ['Boss_771','77左(下)飛龍','','','','','',''],
            ['Boss_772','77右(上)飛龍','','','','','',''],
            ['Boss_773','大黑長者','','','','','',''],
            ['Boss_Bird','不死鳥','','','','','',''],
            ['Boss_EF','伊弗利特','','','','','',''],
            ['Boss_G','小綠','','','','','',''],
            ['Boss_R','小紅','','','','','',''],
            ['Boss_Magic','魔法師','','','','','',''],
            ['Boss_Tree','樹精','','','','','',''],
            ['Boss_Doppelganger','變形怪首領','','','','','',''],
            ['Boss_Four','四色','','','','','',''],
            ['Boss_304','賽尼斯的分身','','','','','',''],
            ['Boss_General','暗黑大將軍貝里斯','','','','','',''],
            ['Boss_Wolf','力卡溫','','','','','',''],
            ['Boss_Kete','克特','','','','','',''],
            ['Boss_Caster','卡司特','','','','','',''],
            ['Boss_Devil','惡魔監視者','','','','','',''],
            ['Boss_Rabbit','曼波兔王','','','','','',''],
            ['Boss_Faust','浮士德','','','','','',''],
            ['Boss_Baphomet','巴風特','','','','','','']
            ['Boss_Orcus','烏勒(19)','','','','','',''],
            ['Boss_Necuros','奈克(49)','','','','','','']
            ], dtype=object)
        np.save('LineageM/RecordList_' + GroupID, Boss_List)